import React, { useState } from 'react';
import './About.css';

const About = () => {
  const [currentImageIndex, setCurrentImageIndex] = useState(0);

  const images = [
    'group1.jpg',
    'group2.jpg',
    'group3.jpg',
    'group4.jpg',
    // 'group5.jpg',
    'group6.jpg',
    'group7.jpg',

  ];

  const handleNext = () => {
    setCurrentImageIndex((prevIndex) =>
      prevIndex === images.length - 1 ? 0 : prevIndex + 1
    );
  };

  const handlePrevious = () => {
    setCurrentImageIndex((prevIndex) =>
      prevIndex === 0 ? images.length - 1 : prevIndex - 1
    );
  };

  return (
    <div className="about">
      <div className="image-slider">
        <button className="arrow left" onClick={handlePrevious}>
          &#8592;
        </button>
        <img
          src={images[currentImageIndex]}
          alt={`Slide ${currentImageIndex + 1}`}
        />
        <button className="arrow right" onClick={handleNext}>
          &#8594;
        </button>
      </div>
      <div className="about-content">
        <h1>About Us</h1>
        <h1>અમારા વિષે</h1>
        <p>
        બાપજી મહારાજ ના સમુદાયના આચાર્ય ભગવંત શ્રી ભદ્રંકરસૂરીશ્વરજી મ સા ના પ્રશિષ્ય નરરત્નસૂરીશ્વરજી મ સા ની પાવન પ્રેરણાથી છેલ્લા 21 વર્ષોથી શાસનની સેવા કરી રહેલ નમો નમ: શાશ્વત પરિવાર ની સ્થાપના સંવત ૨૦૬૦માં ફક્ત ૫ યુવાનોથી થઈ હતી, જે આજે ૨૫૦ થી વધુ ધર્મપ્રેમી યુવાનો સંસ્થા ની અનેકવિધ પ્રવૃત્તિઓમાં જોડાયેલા છે.

શાસન જયવંતુ છે એક માત્ર લક્ષ્ય બનાવીને શાસનના અનેકવિધ કાર્ય સાથે જોડાયેલ અમારી આ સંસ્થા અનેક ગુરૂ ભગવંત ના માર્ગદર્શન હેઠળ કાર્યો અમદાવાદ રાજનગર સુધી સીમિત ન રહેતા સમગ્ર ભારતભરમાં પોતાના ધર્મકાર્યોથી સુવાસિત બન્યું છે.

સંસ્થા નું કાર્ય સાત જાત્રા કરાવવાની પ્રવૃતિથી શરૂ કરીને આજે તીર્થ રક્ષાના કાર્યો, મહાત્મા ની પાલખી નું સંચાલન, સાધુ સાધ્વીજી વૈયાવચ્ચ, ચાતુર્માસ દરમ્યાન બાળકો માટે તપ અભિયાન, સાધર્મિક સહાય, અનુકંપા અભિયાન, જીવદયાની અનેક પ્રવૃતિ ધ્વારા શાસનની સેવા કરી રહ્યું છે. બોડેલી ની આસપાસના આદિવાસી બાળકો ના સંસ્કરણ માટે ૨૦ જેટલા ગામમાં જૈન પાઠશાળા ચાલુ છે. ધીણોજ તીર્થ મધ્યે ૭૦ જેટલા જૈનેતર બાળકો નુ નિશુલ્ક ગુરૂકુળ ચાલી રહેલ છે. 

નિત્ય આરાધના જેવી કે બેસણા, પ્રતિકમણ તથા ચોવિહાર વગેરે ધર્મપ્રવૃતિને જીવનમાં ઉતારનારા યુવાનોએ અમારા ગ્રુપની શોભા વધારી છે.

        </p>
        <h1>ઉપકાર સ્મરણ</h1>
        <p>
        શ્રી શત્રુંજય ગિરિરાજ તીર્થમંડન શ્રી આદિનાથ દાદા અને શ્રી ધીણોજ તીર્થમંડન શ્રી જોટવા પાર્શ્વનાથ દાદાની અનહદ કૃપા અને બાપજી મહારાજ સાહેબ અને ભદ્રંકરસૂરીશ્વરજી મ સા ના દિવ્ય આશીષ અને આચાર્ય ભગવંત શ્રી નરરત્નસૂરીશ્વરજી મ સા નુ સાનિધ્ય, માર્ગદર્શન, પ્રેરણા અને આશીર્વાદ અને અનેક પૂજ્ય ગુરૂ ભગવંતોના અંતરના આશિષ અમારો પ્રેરણા સ્તોત્ર છે.

        </p>
      </div>
    </div>
  );
};

export default About;
